---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledHeight
source: html/a6b5d0b7-3cfa-b9db-a273-e2aac2360a57.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledHeight Property

The height of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledHeight { get; set; }
```